{
  "contact" : {
    "name"     : "Danilo Guanabara",
    "title"    : "Software Engineer",
    "address"  : "Morumbi. São Paulo, São Paulo. Brazil",
    "phone"    : "+55 11 9 8250 0040",
    "email"    : "danguafer@gmail.com",
    "birthday" : "02/07/1988"
  },
  "education": {
    "title": "Bachelors in Computer Science",
    "institute": "State University of São Paulo"
  },
  "experiences": [
    {
      "company": "New Byte Order",
      "description": "Hybrid textual-visual programming language",
      "role": {
        "name": "Luna-lang Core Developer",
        "period": "Nov 2019 – Current",
        "location": "Kraków, Małopolskie. POL",
        "keywords": ["Rust", "WebAssembly", "WebGL", "GUI Systems", "Physics Simulation", "Data Visualization"],
        "activities": "In mid 2019, I heard about a job opening to work on Luna project. It was a perfect match: I was looking to develop in Rust, I filled all the job requirements and I also have been thinking for a long time to create a visual programming language to democratize software development.\n\nDuring my first days at the company, I was responsible for creating part of our GUI renderer, mixing up CSS 3D with WebGL objects. I also developed the user input system and finished our mouse based graph navigation using physics simulation for a smoothed experience.\n\nOne of the most exciting functionalities I had the opportunity to work on was the Graph Editor, a node-based programming tool which edits and updates textual code as the user creates nodes and adds new connections."
      }
    },
    {
      "company": "Shield AI",
      "description": "Natsec automonous robots",
      "role": {
        "name": "Simulation Engineer",
        "period": "Jun 2018 – Jul 2019",
        "location": "Pittsburgh, PA. USA",
        "keywords": ["C/C++", "Unreal Engine 4", "ROS", "Procedural Generation", "Simulation Models", "Microsoft AirSim"],
        "activities": "In 2018, part of Red Pill VR's team was hired by Shield AI, a company heardquartered in San Diego that develops autonomous quadcopters to map buildings, to identify objects and threats, making data available for tactical decisions.\n\nWe then composed the simulation team. My first project at Shield AI's was to developed a procedural building, bunkers and caves generator.\n\nLater, I worked on a mission playback and data visualization project. I developed the GUI and the sensors visualizers for Sonar, LIDAR, Distance and IMU. And I also worked on the PointCloud renderer, used for visualizing the points provided by the robot's depth camera.\n\nI was also responsible for integrating the ROS platform with our UE4's simulation system, creating sensors simulation models and defining virtual quadcopter models, using the different components we had."
      }
    },
    {
      "company": "Red Pill VR",
      "description": "Virtual Reality experiences",
      "role": {
        "name": "Graphics Engineer",
        "period": "Jul 2017 – Sep 2018",
        "location": "Los Angeles, CA. USA",
        "keywords": ["C/C++", "Unreal Engine 4", "Rendering System", "VR Optimization", "PhysX", "Procedural Animation", "Inverse Kinematics"],
        "activities": "On my second contact with Red Pill VR, I was hired full time to work on a company's new project: Social Venue. Social Venue is a virtual reality multiplayer music experience. We had two different interfaces to join this environment: player and DJ.\n\nThe DJ could use a real CDJ synced up with a virtual CDJ via MIDI. To make it a fluid experience, we replicated the hands pose on the CDJ using Leap Motion's fingers tracking.\n\nThe player was able to explore and interact with many visual effects synchronized with music.\n\nWe used the newest musical analysis engine, now called Venice, to synchronize the effects with music. On Venice, I worked on simplifying the API to make it easier to use by technical artists and on its beats and notes detection.\n\nWe used a stateless server for the experience. To synchronize the experience between players, I created a p2p mechanism to distribute the state between them. The states were lost when there was no player to store the data, allowing the experience to be restarted.\n\nI also worked on many visual effects synced with music and in one of Social Venue's gameplays, called Moon Gravity, which was partially based on the gameplay of Echo Arena."
      }
    },
    {
      "company": "Yandeh",
      "description": "Retail Industry BI Solutions",
      "role": {
        "name": "IoT Engineer",
        "period": "Mar 2016 – Nov 2016",
        "location": "São Paulo, SP. BRA",
        "keywords": ["C/C++", "Java", "Javascript", "Python", "Shell Script", "AWS S3", "AWS Cloudwatch", "AWS IAM", "AWS SNS", "AWS API Gateway", "AWS SES", "AWS EC2", "AWS Lambda", "Elasticsearch", "Tableau"],
        "activities": "In the beginning of 2016, I was invited to be part of the initial team of Yandeh, a company founded by partners of the biggest brazilian bank, Itaú Bank, with the purpose of mapping and tracking the national retail industry, providing business inteligence services.\n\nBeyond working as a software engineer, developing data capture IoT devices, I was also responsible for hiring, branding and stablishing the company's culture. In 1 year, we got a vast clientele of brazilian brands, selling services of geolocalized consumption analysis and advertising impact prediction."
      }
    },
    {
      "company": "Red Pill VR X",
      "description": "Virtual Reality experiences",
      "role": {
        "name": "Technical Artist",
        "period": "Nov 2015 – Jul 2016",
        "location": "Los Angeles, CA. USA",
        "keywords": ["Virtual Reality HMD" , "Audio Visualization", "Onset Detection", "PopcornFX particle system", "Direct 3D 11", "HLSL", "Compute Shaders"],
        "activities": "By the end of 2015, I had my first contact with Red Pill VR, a virtual reality experiences startup headquartered in Los Angeles.\n\nThe company got interested in my curriculum and they invited me to develop real time VFX using the particle system tool PopcornFX on Unreal Engine 4, synchronizing the effects with the first version of Red Pill's musical analysis engine called Nebula."
      }
    },
    {
      "company": "Ortiz Gaming",
      "description": "Casino games solutions",
      "role": {
        "name": "Embedded Systems Software Engineer",
        "period": "Nov 2014 – Aug 2015",
        "location": "São Paulo, SP. BRA",
        "keywords": ["C/C++", "Embedded Systems", "x86-64", "Image Processing", "DSP Filters", "TCP/IP stack", "Software Engineering"],
        "activities": "When I returned to Brazil, my experience with Digisign and the mexican market caught the attention of Ortiz Gaming, a casino solutions company which main clients were from hispanics countries. The company developed its own gaming machine, integrating third-parties components, like bill acceptors, or its own components, like electronic party poppers. The company also develops the games for its platforms.\n\nMy first job at Ortiz Gaming was to normalize the frequency response of the audio on all platforms, which was done with a SIMD optimized equalizers.\n\nAn unified hardware testing platform was another urgent need of the company. For this solution, I created several unit tests for the components and I made a GUI for manually testing the available IO components, like bill acceptors, printers, buttons and speakers.\n\nThe company's main goal in 2015 was to enter the American market in Las Vegas but, to accomplish that, we had to be compliant to the local gambling laws. I worked on the software requirements to enter this market, implementing the GAT (Gaming Authentication Terminal) protocol in our gaming machines. This interface was required to simulate gaming operations, ensuring the return rate required by law.\n\nMy last contribution to the company was the creation of a game template to speed up games prototypes by the art team."
      }
    },
    {
      "company": "Digisign",
      "description": "Digital Signage Solutions",
      "role": {
        "name": "Embedded Systems Software Engineer",
        "period": "Aug 2012 – Jul 2013",
        "location": "Mexico City, DF. MEX",
        "keywords": ["C/C++", "OpenGL", "WebGL", "HTML5", "Javascript", "ActionScript", "NodeJS", "Mobile Development", "Inertial Navigation", "Pathfinding", "Graphics Engineering", "Game Engineering"],
        "activities": "The beginning of my professional career happened at Digisign México, a startup that developed totems for malls. The company developed its own hardware, software and its contents.\n\nI was hired by the company in late 2012 for working on site developing promotional games and drivers for its proprietary touchscreens.\n\nLater, I was responsible for the project to create the new totem platform for malls. The platform consisted of a map, routes for stores, store search by items and a list of promotional items."
      }
    }
  ],
  "knowledges": [
    { "name": "Languages", "info": ["C/C++", "Rust", "C#", "Objective-C", "Swift", "Python", "Perl", "Ruby", "Lisp", "Haskell", "Java", "Javascript", "ActionScript", "x86-64", "MIPS & ARM"] },
    { "name": "Robotics", "info": ["ROS", "Microsoft AirSim"] },
    { "name": "Gamedev", "info": ["Unreal Engine 4", "Popcorn FX"] },
    { "name": "OS Programming", "info": ["Windows", "Linux", "Android (Java", "NDK", "AOSP)", "OSX & iOS"] },
    { "name": "Graphics API", "info": ["Vulkan", "OpenGL", "OpenGL ES", "WebGL & Direct3D"] },
    { "name": "Computer Vision API", "info": ["OpenCV", "OpenNI & Kinect SDK"] },
    { "name": "Audio API", "info": ["OpenAL", "OpenSL ES", "ALSA", "DirectSound & WebAudio"] },
    { "name": "Computing API", "info": ["OpenCL", "WebCL", "Vulkan & Compute Shaders"] },
    { "name": "Protocols", "info": ["Ethernet", "IEEE 802.11", "IP", "TCP", "UDP", "WebSocket", "DHCP", "ISO 8583"] },
    { "name": "Cloud", "info": ["AWS IAM", "AWS SNS", "AWS SES", "AWS S3", "AWS EC2", "AWS API Gateway", "AWS Lambda", "AWS Cloudwatch", "Elasticsearch"] },
    { "name": "Web", "info": ["HTML5", "CSS3", "AngularJS", "ReactJS", "Vue.js", "Node.js & Emscripten"] },
    { "name": "Misc", "info": ["git", "git lfs", "Boost", "POCO & JUCE"] }
  ],
  "languages": [
    { "name": "Portuguese", "info": ["Native"] },
    { "name": "English", "info": ["Advanced"] },
    { "name": "Spanish", "info": ["Advanced"] }
  ],
  "links": [
    { "name": "GitHub", "info": ["https://www.github.com/notdanilo"] },
    { "name": "LinkedIn", "info": ["https://br.linkedin.com/in/danilo-guanabara-44743a45"] }
  ]
}
